{
  "comments": [
    {
      "id": 1,
      "reader": "Megha Mandavia",
      "title": "India's Gig Workers Are Up in Arms, and Tech Firms Should Worry",
      "comment": "Delivery drivers,  crucial to the country's burgeoning tech sector, are starting to push back harder for financial protections.",
      "image": "https://images.wsj.net/im-593682/social"
    },
    {
      "id": 2,
      "reader": "Alexandra Bruell",
      "title": "TROUBLES: NEWSWEEK Engulfed in Legal Drama as Owners Sue Each Other...",
      "comment": "Lawsuits from key players include allegations of falsified records, stolen trade secrets and reputational damage.",
      "image": "https://images.wsj.net/im-593444/social"
    },
    {
      "id": 3,
      "reader": "Jacob Gallagher",
      "title": "Brad Pitt's Skirt Has a Business Agenda",
      "comment": "In a tight attention economy, male movie stars are using unconventional red-carpet style to bring eyeballs, press and even box-office dollars their way",
      "image": "https://images.wsj.net/im-593182/social"
    },
    {
      "id": 4,
      "reader": "Christopher Mims",
      "title": "Procter & Gamble Sounds a Warning After Strong Quarter",
      "comment": "The consumer-products giant reported its biggest annual sales increase in 16 years, but said that consumers are starting to cut back.",
      "image": "https://images.wsj.net/im-589776/social"
    },
    {
      "id": 5,
      "reader": "Timothy Puko and Katy Stech Ferek",
      "title": "Senate Climate Bill Is a Boon for Fossil Fuels",
      "comment": "The $369 billion measure has tax incentives to spur clean energy, but also guarantees for oil and gas drilling in what Sen. Joe Manchin calls an “all-in energy policy.",
      "image": "https://images.wsj.net/im-593163/social"
    },
    {
      "id": 6,
      "reader": "Asa Fitch",
      "title": "Intel Posts Sharp Drop in Sales, Issues Muted Outlook",
      "comment": "The chip maker's results reflect a slump in personal-computer purchases after two years of strong pandemic-era demand.",
      "image": "https://images.wsj.net/im-589772/social"
    },
    {
      "id": 7,
      "reader": "Denny Jacob",
      "title": "Roku Swings to Second-Quarter Loss on Slower Ad Spending",
      "comment": "Shares dive after hours as the streaming-hardware company's results miss analyst expectations.",
      "image": "https://images.wsj.net/im-593288/social"
    },
    {
      "id": 8,
      "reader": "Nicole Nguyen",
      "title": "Why You Should—or Shouldn't—Buy a Home Security Camera",
      "comment": "Smart cameras from Ring, Nest, Arlo and others are useful, but you can protect your privacy and that of your neighbors by enabling encryption and other settings.",
      "image": "https://images.wsj.net/im-591968/social"
    },
    {
      "id": 9,
      "reader": "Ian Talley",
      "title": "U.S. Eyes Sanctions Against Global Network It Believes Is Shipping Iranian Oil",
      "comment": "The U.S. believes a global network of companies has been helping Iran evade sanctions and export oil by blending it with Iraqi oil in ship-to-ship transfers at sea to hide its origins.",
      "image": "https://images.wsj.net/im-593880/social"
    },
    {
      "id": 10,
      "reader": "Mark Maremont",
      "title": "Profits From NC Casino Go to Relatives of Politicians...",
      "comment": "Relatives of U.S. Rep. Jim Clyburn and former South Carolina Gov. Nikki Haley got secret stakes in a company set to profit from a new tribal casino as it was seeking federal approval. Those involved deny any quid pro quo.",
      "image": "https://images.wsj.net/im-581989/social"
    },
    {
      "reader": "Angus Loten",
      "title": "Automation Tech Company UiPath Acquires AI Startup Re:infer",
      "comment": "The deal comes as demand increases for software automation, which can take up the slack caused by hiring freezes or spending cuts",
      "image": "https://images.wsj.net/im-595225/social",
      "id": 11
    },
    {
      "reader": "Angus Loten",
      "title": "The Gate",
      "comment": "The deal comes as demand increases for software automation, which can take up the slack caused by hiring freezes or spending cuts",
      "image": "https://images.wsj.net/im-595225/social",
      "id": 12
    }
  ]
}